

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьДатуДвижения = ЭтоНовый() ИЛИ Движения.ОстаткиМатериалов.Модифицированность();
	
	Если НЕ ОбновитьДатуДвижения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВводНачальныхОстатковНоменклатуры.Дата
			|ИЗ
			|	Документ.ВводНачальныхОстатковНоменклатуры КАК ВводНачальныхОстатковНоменклатуры
			|ГДЕ
			|	ВводНачальныхОстатковНоменклатуры.Ссылка = &ТекущийДокумент";
		
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();		
		Выборка.Следующий();
		ОбновитьДатуДвижения = Выборка.Дата <> Дата;
		
	КонецЕсли;
	
	Если ОбновитьДатуДвижения Тогда
		
		Если НЕ Движения.ОстаткиМатериалов.Выбран() ИЛИ Движения.ОстаткиМатериалов.Модифицированность() Тогда	
			Движения.ОстаткиМатериалов.Прочитать();
		КонецЕсли;
		
		Для Каждого ЗаписьРегистра Из Движения.ОстаткиМатериалов Цикл
			ЗаписьРегистра.Период = Дата;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
