

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц();
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = "ВЫБРАТЬ
	|	Приход.Материал КАК Материал,
	|	Приход.Ссылка.Дата,
	|	Приход.Ссылка.Номер
	|ПОМЕСТИТЬ ВТПриход
	|ИЗ
	|	Документ.ПриходнаяНакладная.Материалы КАК Приход
	|ГДЕ
	|	Приход.Ссылка.Номер = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Материал";
	
	Запрос.УстановитьПараметр("Ссылка", "000000001");
	Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	|	Ном.Наименование,
	|	ВТПриход.Дата,
	|	ВТПриход.Номер
	|ИЗ
	|	ВТПриход КАК ВТПриход
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ВТПриход.Материал = Ном.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ном.Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос2.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Сообщить("" + Строка(Выборка.Наименование) + ", "  + Строка(Выборка.Дата) + ", " + Строка(Выборка.Номер));
		
	КонецЦикла;
	
КонецПроцедуры
