&НаКлиенте
Перем ОтветПередДобавлением;

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура(" МножественныйВыбор", Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.Материалы);
		
КонецПроцедуры

&НаКлиенте
Асинх Процедура МатериалыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ОтветПередДобавлением <> Истина Тогда
		СтандартнаяОбработка = Ложь;
		Результат = Ждать ВопросАсинх("Подобрать номенклатуру в документ?", 
			РежимДиалогаВопрос.ДаНет);
		
		Если Результат = КодВозвратаДиалога.Да Тогда 
			
			ОтветПередДобавлением = Истина;
		
			Для каждого Значение Из ВыбранноеЗначение Цикл
				
				НоваяСтрока = Объект.Материалы.Добавить();
				НоваяСтрока.Материал = Значение;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		Для каждого Значение Из ВыбранноеЗначение Цикл
				
			НоваяСтрока = Объект.Материалы.Добавить();
			НоваяСтрока.Материал = Значение;
				
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	РаботаСДокументамиКлиент.РасчитатьСумму(СтрокаТабличнойЧасти);	
	
КонецПроцедуры
