Процедура ПриНачалеРаботыСистемы()
	
	ПроверкаРабочегоВремени();
	
	ПланПоиска = ГлобальныйПоиск.ПолучитьПлан();
	
	ПланПоиска.Удалить(СтандартныйВидГлобальногоПоиска.ВсеФункции);
	ПланПоиска.Удалить(СтандартныйВидГлобальногоПоиска.Справка);
	
	ГлобальныйПоиск.УстановитьПлан(ПланПоиска);
	
	ГлобальныйПоиск.УстановитьОписание("Введите строку поиска, ссылку или арифметическое выражение." + Символы.ПС +
	"Для поиска документов об оказании услуг по номеру введите ""№"" и сразу за ним без пробела часть номера.");
		
КонецПроцедуры

Процедура ПроверкаРабочегоВремени()
	
	ДеньНедели = ДеньНедели(ТекущаяДата());
	
	Если ДеньНедели = 6 ИЛИ ДеньНедели = 7 Тогда
		ПоказатьОповещениеПользователя("Сегодня не рабочий день");
	Иначе
		ПоказатьОповещениеПользователя("Сегодня рабочий день");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	Если СтрНайти(СтрокаПоиска, "№") = 1 Тогда
		
		ПланПоиска.Очистить();
		ПланПоиска.Вставить(0, "ПоискДокументовПоНомеру", "ГлобальныйПоискВДанных", Истина);
		
	КонецЕсли;
	
КонецПроцедуры
